[
  {
    "id": 1,
    "name": "Mechanical Keyboard",
    "description": "With responsive keys and uses blue switches. Ideal for typing and gaming enthusiasts due to its tactile feedback and audible click sound.",
    "price": 70.99,
    "stars": 5,
    "image": "images/keyboard1.jpg",
    "category": "Keyboard"
  },
  {
    "id": 2,
    "name": "Wireless Mouse",
    "description": "The ergonomic design prevents hand fatigue, ensuring comfort for extended usage. Features wireless connectivity for hassle-free use.",
    "price": 80.55,
    "stars": 5,
    "image": "images/mouse1.jpg",
    "category": "Mouse"
  },
  {
    "id": 3,
    "name": "Gaming Headset",
    "description": "Equipped with immersive surround sound and soft ear cushions for long-lasting comfort. Perfect for gaming sessions with clear audio quality.",
    "price": 90.5,
    "stars": 5,
    "image": "images/headset1.jpg",
    "category": "Headset"
  },
  {
    "id": 4,
    "name": "Monitor",
    "description": "This monitor features high resolution and eye-care features to reduce strain. Ideal for both work and entertainment with sharp, vivid visuals.",
    "price": 100.99,
    "stars": 5,
    "image": "images/monitor1.jpg",
    "category": "Monitor"
  },
  {
    "id": 5,
    "name": "Laptop",
    "description": "Designed for productivity with a fast processor, offering efficient performance for work, gaming, and multimedia consumption.",
    "price": 150.2,
    "stars": 5,
    "image": "images/laptop1.jpg",
    "category": "Laptop"
  },
  {
    "id": 6,
    "name": "Wired Mouse",
    "description": "Flexible cable provides a direct connection with no interruptions, perfect for working or gaming. Reliable and responsive with no input lag.",
    "price": 60.55,
    "stars": 5,
    "image": "images/mouse2.jpg",
    "category": "Mouse"
  },
  {
    "id": 7,
    "name": "Earphone",
    "description": "Balanced sound with solid bass. Compact and lightweight design, making them ideal for on-the-go listening and hands-free calls.",
    "price": 40.73,
    "stars": 5,
    "image": "images/earphone1.jpg",
    "category": "Headset"
  },
  {
    "id": 8,
    "name": "Magic Keyboard",
    "description": "Provides a more comfortable and responsive typing experience. Features a sleek design with low-profile keys for smooth typing.",
    "price": 30.99,
    "stars": 5,
    "image": "images/keyboard2.jpg",
    "category": "Keyboard"
  },
  {
    "id": 9,
    "name": "Usb Cable",
    "description": "Offers fast and stable connectivity between your devices. Built to last with durable materials, ensuring long-term performance.",
    "price": 73.99,
    "stars": 5,
    "image": "images/kabel1.jpg",
    "category": "Cable"
  },
  {
    "id": 10,
    "name": "Speaker",
    "description": "Designed to provide clear sound and deep bass, this speaker offers optimal sound quality for music, movies, and gaming. Its portable and compact design allows for easy transport, making it perfect for both indoor and outdoor use.",
    "price": 32.99,
    "stars": 5,
    "image": "images/speaker1.jpg",
    "category": "Speaker"
  },
  {
    "id": 11,
    "name": "Wireless Keyboard",
    "description": "Wireless Bluetooth technology provides typing comfort without cables. Slim and elegant design with a long battery life for uninterrupted work.",
    "price": 40.99,
    "stars": 5,
    "image": "images/keyboard3.jpg",
    "category": "Keyboard"
  },
  {
    "id": 12,
    "name": "Gaming Mouse",
    "description": "This gaming mouse is specially designed for gamers who prioritize speed and precision, with an advanced sensor and adjustable DPI. Durable and responsive.",
    "price": 89.55,
    "stars": 5,
    "image": "images/mouse3.jpg",
    "category": "Mouse"
  },
  {
    "id": 13,
    "name": "TWS Earphone",
    "description": "Offers high-quality sound with a compact and comfortable design. Equipped with Bluetooth wireless technology and deep bass for immersive music experiences.",
    "price": 20.73,
    "stars": 5,
    "image": "images/earphone2.jpg",
    "category": "Headset"
  },
  {
    "id": 14,
    "name": "HDMI Cable",
    "description": "Provides high-quality video and audio connections between devices like TVs, monitors, laptops, or gaming consoles. With high data transfer speed for clear visuals.",
    "price": 22.99,
    "stars": 5,
    "image": "images/kabel2.jpg",
    "category": "Cable"
  },
  {
    "id": 15,
    "name": "Power Adapter Cable",
    "description": "Made from high-quality materials, this cable ensures stable and fast power delivery, keeping your devices ready for use and extending battery life.",
    "price": 14.99,
    "stars": 5,
    "image": "images/kabel3.jpg",
    "category": "Cable"
  },
  {
    "id": 16,
    "name": "USB Drive",
    "description": "Offers portable storage with a large capacity in a compact size. Easy to use, just plug it into a USB port to transfer files at high speeds for convenience.",
    "price": 24.99,
    "stars": 5,
    "image": "images/storage1.jpg",
    "category": "storage"
  },
  {
    "id": 17,
    "name": "HDD",
    "description": "Provides large data storage with high reliability. This HDD offers a large capacity of up to 1TB With fast read/write speeds and robust design, it ensures your data is safe while being easily accessible.",
    "price": 60.99,
    "stars": 5,
    "image": "images/hdd.jpg",
    "category": "storage"
  },
  {
    "id": 18,
    "name": "SSD",
    "description": "This SSD delivers exceptional read and write speeds, making your system run faster and more responsive. With 512GB capacity, it shortens boot-up time for a smooth experience.",
    "price": 74.99,
    "stars": 5,
    "image": "images/ssd.jpg",
    "category": "storage"
  },
  {
    "id": 19,
    "name": "Cooling Pad",
    "description": "Equipped with two fans working efficiently to keep your device’s temperature stable, preventing overheating and ensuring smooth performance during intensive tasks.",
    "price": 35.99,
    "stars": 5,
    "image": "images/cooler1.jpg",
    "category": "cooler"
  },
  {
    "id": 20,
    "name": "Fan Cooler",
    "description": "Specially designed to cool your phone, keeping the temperature stable while gaming or using heavy apps. This fan cooler is easy to install and use, perfect for mobile gamers.",
    "price": 10.99,
    "stars": 5,
    "image": "images/cooler2.jpg",
    "category": "cooler"
  }
]
